------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /data/uctprgu/cps/program/log_transition.log
  log type:  text
 opened on:   2 May 2012, 16:55:56

. set more 1

. 
. capture program drop transition2

. program define transition2
  1.   transition3 `1' 1  
  2.   transition3 `1' 2
  3.   transition3 `1' 3
  4.   transition3 `1' 4
  5.   transition3 `1' 5
  6.   transition3 `1' 6
  7.   transition3 `1' 7
  8.   transition3 `1' 8
  9.   transition3 `1' 9
 10.   transition3 `1' 10
 11.   transition3 `1' 11
 12.   transition3 `1' 12
 13. end

. 
. capture program drop transition3

. program define transition3
  1.   quietly {
  2.   ** Matching is not possible due to sample redesigns between
.   ** Jul to Dec 1984 4s to their 1985 8s
.   ** Jan to Sep 1985 4s to their 1986 8s
.   ** Jun to Dec 1994 4s to their 1995 8s
.   ** Jan to Aug 1995 4s to their 1996 8s
.     if (`1' == 1984 & (`2' == 7 | `2' == 8 | `2' == 9 | `2' == 10| `2' == 11| `2' == 12)
> ) | (`1' == 1985 & (`2' == 1 | `2' == 2 | `2' == 3 | `2' == 4 | `2' == 5 | `2' == 6 |`2'
>  == 7 | `2' == 8 | `2' == 9)) | (`1' == 1994 & (`2' == 6 | `2' == 7 | `2' == 8 | `2' == 
> 9 | `2' == 10 | `2' == 11 | `2' == 12)) | (`1' == 1995 & (`2' == 1 | `2' == 2 | `2' == 3
>  | `2' == 4 | `2' == 5 | `2' == 6 |`2' == 7 | `2' == 8)) {
  3.       clear
  4.       set obs 1
  5.       * the series is saved in the same month last year
.           gen year = `1' + 1
  6.       gen month = `2'
  7.           gen qtr = int((month - 1) / 3) + 1
  8.       gen date = year * 100 + month
  9.       forvalues m = 1/10 { 
 10.         forvalues n = 1/10 {
 11.           gen tranD`m'D`n' = .
 12.         }
 13.       }
 14.     }
 15.     
.     else {
 16.       clear 
 17.           use ../basic_extract/org_merg`1' if month == `2' 
 18.           * find the wage decile for each observation
.       xtile decile = w_ln_no [pweight = orgwgt], nq(10)
 19.       xtile mdecile = mw_ln_no [pweight = morgwgt], nq(10)
 20.       
.           * keep only the observations have wage information in both months
.       keep if decile != . & mdecile != . 
 21. 
.       * create sorting variable "tran" categoried by transition between wage deciles    
>   
.       tostring decile, replace
 22.       tostring mdecile, replace
 23.       replace decile = "D" + decile 
 24.       replace mdecile = "D" + mdecile
 25.       gen str6 tran = decile + mdecile 
 26.       
.       gen date = (year + 1) * 100 + month
 27.       sort date tran
 28. 
.       * sum weight for each category      
.       replace orgwgt = 0 if orgwgt == .
 29.       replace morgwgt = 0 if morgwgt == .
 30.       gen weight = (orgwgt+morgwgt)/2
 31.       egen double trans = sum(weight), by(date tran)
 32.       replace trans = trans / 1000
 33.           
.       sort date tran
 34.       quietly by date tran:  gen duplic = cond(_N==1,0,_n)
 35.       drop if duplic > 1
 36.       keep date tran trans
 37. 
.       reshape wide trans, i(date) j(tran) string
 38.       
.           * some transitions do not exist so just give them value 0
.       forvalues m = 1/10 { 
 39.         forvalues n = 1/10 {
 40.           capture confirm variable transD`m'D`n'
 41.           if _rc {
 42.             gen transD`m'D`n' = 0
 43.           }
 44.         }
 45.       }
 46.       
.           * calculate the rates from the levels
.       forvalues m = 1/10 { 
 47.         forvalues n = 1/10 {
 48.           gen tranD`m'D`n' = transD`m'D`n' / (transD`m'D1 + transD`m'D2 /*
>           */ + transD`m'D3 + transD`m'D4 + transD`m'D5 + transD`m'D6 /*
>           */ + transD`m'D7 + transD`m'D8 + transD`m'D9 + transD`m'D10)
 49.         }
 50.       }
 51. 
.       drop trans*
 52.       gen year = `1' + 1
 53.       gen month = `2'
 54.           gen qtr = int((month - 1) / 3) + 1
 55.     }
 56.     
.     order year qtr month date, first
 57. 
.     if date >= 198002 {
 58.       append using ../result/transition.dta
 59.     }
 60.     
.     saveold ../result/transition.dta, replace
 61.   }
 62.   
.   sort year qtr month date 
 63.   saveold ../result/transition.dta, replace
 64. end 

. 
. transition2 1979
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved

. transition2 1980 
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved

. transition2 1981 
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved

. transition2 1982 
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved

. transition2 1983
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved

. transition2 1984
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved

. transition2 1985 
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved

. transition2 1986 
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved

. transition2 1987 
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved

. transition2 1988 
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved

. transition2 1989 
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved

. transition2 1990 
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved

. transition2 1991 
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved

. transition2 1992 
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved

. transition2 1993 
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved

. transition2 1994 
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved

. transition2 1995 
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved

. transition2 1996 
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved

. transition2 1997 
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved

. transition2 1998 
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved

. transition2 1999 
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved

. transition2 2000
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved

. transition2 2001
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved

. transition2 2002
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved

. transition2 2003
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved

. transition2 2004
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved

. transition2 2005
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved

. transition2 2006
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved

. transition2 2007
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved

. transition2 2008
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved

. transition2 2009
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved

. transition2 2010
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved
file ../result/transition.dta saved

. 
. *** Seasonally adjust the wage transitions (ratio-to-MA method):
. gen t = tm(1980m1) + _n - 1

. format t %tm

. tsset t
        time variable:  t, 1980m1 to 2011m12
                delta:  1 month

. order year qtr month date t, first

. sort year qtr month date t

. saveold ../result/transition.dta, replace
file ../result/transition.dta saved

. 
. qui foreach XY of varlist tran* {

.  
. keep year qtr month date t SA_*

. sort year qtr month date t

. 
. saveold ../result/sa_transition.dta, replace
(note: file ../result/sa_transition.dta not found)
file ../result/sa_transition.dta saved

. 
. 
. log close
      name:  <unnamed>
       log:  /data/uctprgu/cps/program/log_transition.log
  log type:  text
 closed on:   2 May 2012, 16:57:26
------------------------------------------------------------------------------------------
