------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /data/uctprgu/cps/program/log_matchorg.log
  log type:  text
 opened on:   2 May 2012, 16:51:21

. set more 1

. 
. capture program drop match2

. program define match2
  1.   local nextyear = `1' + 1
  2. 
. * STEP 1:  Load data for individuals in time t+1
.   clear
  3.   display "Reading in t+1 Data"
  4.   use ../cepr/cepr_org_`nextyear' if minsamp==8
  5.   drop minsamp
  6.   label drop _all
  7.   
.   * Rename t+1 variables
.   foreach x of varlist _all {
  8.         rename `x' m`x'
  9.   } 
 10. 
.   *mym is the year and month of the file where matching observations would be
.   gen int mym = `nextyear' * 10 + 8
 11.   label var mym "Match year and month-in-sample"
 12.   * Sort and save t+1 data
.   display "Sort vars"
 13.   rename mmonth month
 14.   rename mhhid hhid
 15.   rename mhhnum hhnum
 16.   rename mlineno lineno
 17.   rename mstate state
 18.   local sort_stem mym month state hhid hhnum 
 19.   if (`nextyear' <= 2006) {
 20.         local sort `sort_stem' lineno
 21.   }
 22.   if (`nextyear' >= 2007 & `nextyear' <= 2011  ) {
 23.         rename mhhid2 hhid2
 24.         tostring hhid2, replace
 25.         local sort `sort_stem' lineno hhid2 
 26.   }
 27.   display "sort `sort'"
 28.   sort `sort'
 29.   display "Generate id"
 30.   gen obsno2 = _n
 31.   saveold match`nextyear'8.dta, replace
 32. 
.   clear
 33. 
. 
. * STEP 2:  Load data for individuals in time t
.   display "Reading in individual data"
 34.   use ../cepr/cepr_org_`1' if minsamp==4
 35. 
.   *mym is the year and month of the file where matching observations would be
.   display "Generate mym for minsamp 4"
 36.   gen int mym = `1' * 10  + 18
 37.   label var mym "Match year and month-in-sample"
 38.   * Sort t data
.   display "Sort vars"
 39.   if (`1' <= 2005) {
 40.         local sort `sort_stem' lineno
 41.   }
 42.   if (`1' >= 2006 & `1' <= 2011  ) {
 43.     tostring hhid2, replace
 44.         local sort `sort_stem' lineno hhid2 
 45.   }
 46.   display "sort `sort'"
 47.   sort `sort'
 48.   display "Generate id"
 49.   gen obsno = _n
 50. 
. 
. * STEP 3:  Merge t+1 data to t data
.   display "Household/family-level match"
 51.   ** Matching is not possible due to sample redesigns between
.   ** Jul to Dec 1984 4s to their 1985 8s
.   ** Jan to Sep 1985 4s to their 1986 8s
.   ** Jun to Dec 1994 4s to their 1995 8s
.   ** Jan to Aug 1995 4s to their 1996 8s
.   **( 79:8s don't have matches )
.   ** No matches yet for most recent year's minsamp 4s
.   
.   capture describe
 52.   local obs_pre = r(N)
 53.     
.   display "Merging `1' minsamp 4 households to minsamp 8 using match`nextyear'8.dta "
 54.   merge `sort' using match`nextyear'8.dta 
 55.   erase match`nextyear'8.dta 
 56. 
. 
. * STEP 4:  Define merge quality variables
. ** Create dummy variables to verify that sex, race, and age match.
. ** A value of 1 indicates a match.  Zero means no match.
.   gen byte sexdif  = female  == mfemale
 57.   gen byte racedif = wbho == mwbho
 58.   gen byte mage_age= mage-age
 59.   gen byte nragedif = (mage_age>=-1 & mage_age<=3)
 60.   gen byte ragedif = (mage_age>=0 & mage_age<=2)
 61.   gen byte edudif = meduc-educ
 62.   gen byte redudif = (edudif==0 | edudif==1)
 63.   gen byte nredudif = (edudif==-1 | edudif==0 | edudif==1 | edudif==2)
 64. 
. * Deal with duplicate observations
. 
.   qui do multobs
 65.   drop _merge 
 66. 
.   gen byte match=0
 67.   replace match=1 if sexdif+racedif+nragedif==3
 68.   
.   * keep only the matched observations
.   keep if match == 1
 69.   drop match
 70.   
.   capture describe
 71.   local obs_post = r(N)
 72.   display `"`obs_pre' observations prior to match"' 
 73.   display `"`obs_post' observations after match"'
 74.   
.   *save the obs_pre and obs_post to file matchorg_match.txt
.   if (`1' == 1979) {
 75.     file open mr using "../result/org_match_rate.txt", write replace
 76.     file write mr "year" _tab "obs_pre" _tab "obs_post" _n
 77.     file write mr %8.0f `"`1'"' _tab %8.0f `"`obs_pre'"' _tab %8.0f `"`obs_post'"' _n
 78.     file close mr
 79.   }
 80.   else {
 81.     file open mr using "../result/org_match_rate.txt", write append
 82.     file write mr %8.0f `"`1'"' _tab %8.0f `"`obs_pre'"' _tab %8.0f `"`obs_post'"' _n
 83.     file close mr
 84.   }
 85.   
.   sort `sort' 
 86.   saveold ../basic_extract/org_merg`1', replace
 87.   clear
 88. end 

. 
. match2 1979
Reading in t+1 Data
(CEPR ORG Extract, Version 1.7.0, 1980)
Sort vars
sort mym month state hhid hhnum lineno
Generate id
(note: file match19808.dta not found)
file match19808.dta saved
Reading in individual data
(CEPR ORG Extract, Version 1.7.0, 1979)
Generate mym for minsamp 4
Sort vars
sort mym month state hhid hhnum lineno
Generate id
Household/family-level match
Merging 1979 minsamp 4 households to minsamp 8 using match19808.dta 
(note: you are using old merge syntax; see [D] merge for new syntax)
variables mym month state hhid hhnum lineno do not uniquely identify observations in the
    master data
variables mym month state hhid hhnum lineno do not uniquely identify observations in
    match19808.dta
(107472 missing values generated)
(108317 missing values generated)
(121381 real changes made)
(110529 observations deleted)
164626 observations prior to match
121381 observations after match
(note: file ../result/org_match_rate.txt not found)
(note: file ../basic_extract/org_merg1979.dta not found)
file ../basic_extract/org_merg1979.dta saved

. match2 1980 
Reading in t+1 Data
(CEPR ORG Extract, Version 1.7.0, 1981)
Sort vars
sort mym month state hhid hhnum lineno
Generate id
(note: file match19818.dta not found)
file match19818.dta saved
Reading in individual data
(CEPR ORG Extract, Version 1.7.0, 1980)
Generate mym for minsamp 4
Sort vars
sort mym month state hhid hhnum lineno
Generate id
Household/family-level match
Merging 1980 minsamp 4 households to minsamp 8 using match19818.dta 
(note: you are using old merge syntax; see [D] merge for new syntax)
variables mym month state hhid hhnum lineno do not uniquely identify observations in the
    master data
variables mym month state hhid hhnum lineno do not uniquely identify observations in
    match19818.dta
(97988 missing values generated)
(98853 missing values generated)
(135568 real changes made)
(101097 observations deleted)
193554 observations prior to match
135568 observations after match
(note: file ../basic_extract/org_merg1980.dta not found)
file ../basic_extract/org_merg1980.dta saved

. match2 1981 
Reading in t+1 Data
(CEPR ORG Extract, Version 1.7.0, 1982)
Sort vars
sort mym month state hhid hhnum lineno
Generate id
(note: file match19828.dta not found)
file match19828.dta saved
Reading in individual data
(CEPR ORG Extract, Version 1.7.0, 1981)
Generate mym for minsamp 4
Sort vars
sort mym month state hhid hhnum lineno
Generate id
Household/family-level match
Merging 1981 minsamp 4 households to minsamp 8 using match19828.dta 
(note: you are using old merge syntax; see [D] merge for new syntax)
variables mym month state hhid hhnum lineno do not uniquely identify observations in the
    master data
variables mym month state hhid hhnum lineno do not uniquely identify observations in
    match19828.dta
(85892 missing values generated)
(86693 missing values generated)
(132554 real changes made)
(88815 observations deleted)
181500 observations prior to match
132554 observations after match
(note: file ../basic_extract/org_merg1981.dta not found)
file ../basic_extract/org_merg1981.dta saved

. match2 1982 
Reading in t+1 Data
(CEPR ORG Extract, Version 1.7.0, 1983)
Sort vars
sort mym month state hhid hhnum lineno
Generate id
(note: file match19838.dta not found)
file match19838.dta saved
Reading in individual data
(CEPR ORG Extract, Version 1.7.0, 1982)
Generate mym for minsamp 4
Sort vars
sort mym month state hhid hhnum lineno
Generate id
Household/family-level match
Merging 1982 minsamp 4 households to minsamp 8 using match19838.dta 
(note: you are using old merge syntax; see [D] merge for new syntax)
variables mym month state hhid hhnum lineno do not uniquely identify observations in the
    master data
variables mym month state hhid hhnum lineno do not uniquely identify observations in
    match19838.dta
(79945 missing values generated)
(80732 missing values generated)
(131215 real changes made)
(82874 observations deleted)
174913 observations prior to match
131215 observations after match
(note: file ../basic_extract/org_merg1982.dta not found)
file ../basic_extract/org_merg1982.dta saved

. match2 1983
Reading in t+1 Data
(CEPR ORG Extract, Version 1.7.0, 1984)
Sort vars
sort mym month state hhid hhnum lineno
Generate id
(note: file match19848.dta not found)
file match19848.dta saved
Reading in individual data
(CEPR ORG Extract, Version 1.7.0, 1983)
Generate mym for minsamp 4
Sort vars
sort mym month state hhid hhnum lineno
Generate id
Household/family-level match
Merging 1983 minsamp 4 households to minsamp 8 using match19848.dta 
(note: you are using old merge syntax; see [D] merge for new syntax)
variables mym month state hhid hhnum lineno do not uniquely identify observations in the
    master data
variables mym month state hhid hhnum lineno do not uniquely identify observations in
    match19848.dta
(83555 missing values generated)
(84286 missing values generated)
(128795 real changes made)
(86620 observations deleted)
174479 observations prior to match
128795 observations after match
(note: file ../basic_extract/org_merg1983.dta not found)
file ../basic_extract/org_merg1983.dta saved

. match2 1984
Reading in t+1 Data
(CEPR ORG Extract, Version 1.7.0, 1985)
Sort vars
sort mym month state hhid hhnum lineno
Generate id
(note: file match19858.dta not found)
file match19858.dta saved
Reading in individual data
(CEPR ORG Extract, Version 1.7.0, 1984)
Generate mym for minsamp 4
Sort vars
sort mym month state hhid hhnum lineno
Generate id
Household/family-level match
Merging 1984 minsamp 4 households to minsamp 8 using match19858.dta 
(note: you are using old merge syntax; see [D] merge for new syntax)
variables mym month state hhid hhnum lineno do not uniquely identify observations in the
    master data
variables mym month state hhid hhnum lineno do not uniquely identify observations in
    match19858.dta
(214339 missing values generated)
(214692 missing values generated)
(62383 real changes made)
(215926 observations deleted)
170223 observations prior to match
62383 observations after match
(note: file ../basic_extract/org_merg1984.dta not found)
file ../basic_extract/org_merg1984.dta saved

. match2 1985 
Reading in t+1 Data
(CEPR ORG Extract, Version 1.7.0, 1986)
Sort vars
sort mym month state hhid hhnum lineno
Generate id
(note: file match19868.dta not found)
file match19868.dta saved
Reading in individual data
(CEPR ORG Extract, Version 1.7.0, 1985)
Generate mym for minsamp 4
Sort vars
sort mym month state hhid hhnum lineno
Generate id
Household/family-level match
Merging 1985 minsamp 4 households to minsamp 8 using match19868.dta 
(note: you are using old merge syntax; see [D] merge for new syntax)
variables mym month state hhid hhnum lineno do not uniquely identify observations in the
    master data
variables mym month state hhid hhnum lineno do not uniquely identify observations in
    match19868.dta
(276100 missing values generated)
(276276 missing values generated)
(31069 real changes made)
(276940 observations deleted)
171215 observations prior to match
31069 observations after match
(note: file ../basic_extract/org_merg1985.dta not found)
file ../basic_extract/org_merg1985.dta saved

. match2 1986 
Reading in t+1 Data
(CEPR ORG Extract, Version 1.7.0, 1987)
Sort vars
sort mym month state hhid hhnum lineno
Generate id
(note: file match19878.dta not found)
file match19878.dta saved
Reading in individual data
(CEPR ORG Extract, Version 1.7.0, 1986)
Generate mym for minsamp 4
Sort vars
sort mym month state hhid hhnum lineno
Generate id
Household/family-level match
Merging 1986 minsamp 4 households to minsamp 8 using match19878.dta 
(note: you are using old merge syntax; see [D] merge for new syntax)
variables mym month state hhid hhnum lineno do not uniquely identify observations in the
    master data
variables mym month state hhid hhnum lineno do not uniquely identify observations in
    match19878.dta
(85254 missing values generated)
(85908 missing values generated)
(122115 real changes made)
(88733 observations deleted)
169200 observations prior to match
122115 observations after match
(note: file ../basic_extract/org_merg1986.dta not found)
file ../basic_extract/org_merg1986.dta saved

. match2 1987 
Reading in t+1 Data
(CEPR ORG Extract, Version 1.7.0, 1988)
Sort vars
sort mym month state hhid hhnum lineno
Generate id
(note: file match19888.dta not found)
file match19888.dta saved
Reading in individual data
(CEPR ORG Extract, Version 1.7.0, 1987)
Generate mym for minsamp 4
Sort vars
sort mym month state hhid hhnum lineno
Generate id
Household/family-level match
Merging 1987 minsamp 4 households to minsamp 8 using match19888.dta 
(note: you are using old merge syntax; see [D] merge for new syntax)
variables mym month state hhid hhnum lineno do not uniquely identify observations in the
    master data
variables mym month state hhid hhnum lineno do not uniquely identify observations in
    match19888.dta
(85590 missing values generated)
(86273 missing values generated)
(117605 real changes made)
(89293 observations deleted)
169079 observations prior to match
117605 observations after match
(note: file ../basic_extract/org_merg1987.dta not found)
file ../basic_extract/org_merg1987.dta saved

. match2 1988 
Reading in t+1 Data
(CEPR ORG Extract, Version 1.7.0, 1989)
Sort vars
sort mym month state hhid hhnum lineno
Generate id
(note: file match19898.dta not found)
file match19898.dta saved
Reading in individual data
(CEPR ORG Extract, Version 1.7.0, 1988)
Generate mym for minsamp 4
Sort vars
sort mym month state hhid hhnum lineno
Generate id
Household/family-level match
Merging 1988 minsamp 4 households to minsamp 8 using match19898.dta 
(note: you are using old merge syntax; see [D] merge for new syntax)
variables mym month state hhid hhnum lineno do not uniquely identify observations in the
    master data
(84902 missing values generated)
(85463 missing values generated)
(114647 real changes made)
(88518 observations deleted)
161061 observations prior to match
114647 observations after match
(note: file ../basic_extract/org_merg1988.dta not found)
file ../basic_extract/org_merg1988.dta saved

. match2 1989 
Reading in t+1 Data
(CEPR ORG Extract, Version 1.7.0, 1990)
Sort vars
sort mym month state hhid hhnum lineno
Generate id
(note: file match19908.dta not found)
file match19908.dta saved
Reading in individual data
(CEPR ORG Extract, Version 1.7.0, 1989)
Generate mym for minsamp 4
Sort vars
sort mym month state hhid hhnum lineno
Generate id
Household/family-level match
Merging 1989 minsamp 4 households to minsamp 8 using match19908.dta 
(note: you are using old merge syntax; see [D] merge for new syntax)
(86264 missing values generated)
(86852 missing values generated)
(120640 real changes made)
(89998 observations deleted)
164056 observations prior to match
120640 observations after match
(note: file ../basic_extract/org_merg1989.dta not found)
file ../basic_extract/org_merg1989.dta saved

. match2 1990 
Reading in t+1 Data
(CEPR ORG Extract, Version 1.7.0, 1991)
Sort vars
sort mym month state hhid hhnum lineno
Generate id
(note: file match19918.dta not found)
file match19918.dta saved
Reading in individual data
(CEPR ORG Extract, Version 1.7.0, 1990)
Generate mym for minsamp 4
Sort vars
sort mym month state hhid hhnum lineno
Generate id
Household/family-level match
Merging 1990 minsamp 4 households to minsamp 8 using match19918.dta 
(note: you are using old merge syntax; see [D] merge for new syntax)
(83111 missing values generated)
(83758 missing values generated)
(125088 real changes made)
(86895 observations deleted)
170206 observations prior to match
125088 observations after match
(note: file ../basic_extract/org_merg1990.dta not found)
file ../basic_extract/org_merg1990.dta saved

. match2 1991 
Reading in t+1 Data
(CEPR ORG Extract, Version 1.7.0, 1992)
Sort vars
sort mym month state hhid hhnum lineno
Generate id
(note: file match19928.dta not found)
file match19928.dta saved
Reading in individual data
(CEPR ORG Extract, Version 1.7.0, 1991)
Generate mym for minsamp 4
Sort vars
sort mym month state hhid hhnum lineno
Generate id
Household/family-level match
Merging 1991 minsamp 4 households to minsamp 8 using match19928.dta 
(note: you are using old merge syntax; see [D] merge for new syntax)
(80014 missing values generated)
(80579 missing values generated)
(123641 real changes made)
(83487 observations deleted)
167000 observations prior to match
123641 observations after match
(note: file ../basic_extract/org_merg1991.dta not found)
file ../basic_extract/org_merg1991.dta saved

. match2 1992 
Reading in t+1 Data
(CEPR ORG Extract, Version 1.7.0, 1993)
Sort vars
sort mym month state hhid hhnum lineno
Generate id
(note: file match19938.dta not found)
file match19938.dta saved
Reading in individual data
(CEPR ORG Extract, Version 1.7.0, 1992)
Generate mym for minsamp 4
Sort vars
sort mym month state hhid hhnum lineno
Generate id
Household/family-level match
Merging 1992 minsamp 4 households to minsamp 8 using match19938.dta 
(note: you are using old merge syntax; see [D] merge for new syntax)
(78211 missing values generated)
(78211 missing values generated)
(122148 real changes made)
(81732 observations deleted)
164942 observations prior to match
122148 observations after match
(note: file ../basic_extract/org_merg1992.dta not found)
file ../basic_extract/org_merg1992.dta saved

. match2 1993 
Reading in t+1 Data
(CEPR ORG Extract, Version 1.7.0, 1994)
Sort vars
sort mym month state hhid hhnum lineno
Generate id
(note: file match19948.dta not found)
file match19948.dta saved
Reading in individual data
(CEPR ORG Extract, Version 1.7.0, 1993)
Generate mym for minsamp 4
Sort vars
sort mym month state hhid hhnum lineno
Generate id
Household/family-level match
Merging 1993 minsamp 4 households to minsamp 8 using match19948.dta 
(note: you are using old merge syntax; see [D] merge for new syntax)
variables mym month state hhid hhnum lineno do not uniquely identify observations in
    match19948.dta
(78807 missing values generated)
(78807 missing values generated)
(117978 real changes made)
(83645 observations deleted)
163478 observations prior to match
117978 observations after match
(note: file ../basic_extract/org_merg1993.dta not found)
file ../basic_extract/org_merg1993.dta saved

. match2 1994 
Reading in t+1 Data
(CEPR ORG Extract, Version 1.7.0, 1995)
Sort vars
sort mym month state hhid hhnum lineno
Generate id
(note: file match19958.dta not found)
file match19958.dta saved
Reading in individual data
(CEPR ORG Extract, Version 1.7.0, 1994)
Generate mym for minsamp 4
Sort vars
sort mym month state hhid hhnum lineno
Generate id
Household/family-level match
Merging 1994 minsamp 4 households to minsamp 8 using match19958.dta 
(note: you are using old merge syntax; see [D] merge for new syntax)
variables mym month state hhid hhnum lineno do not uniquely identify observations in the
    master data
hhid was str12 now str15
variables mym month state hhid hhnum lineno do not uniquely identify observations in
    match19958.dta
(220877 missing values generated)
(220877 missing values generated)
(45475 real changes made)
(222027 observations deleted)
158198 observations prior to match
45475 observations after match
(note: file ../basic_extract/org_merg1994.dta not found)
file ../basic_extract/org_merg1994.dta saved

. match2 1995 
Reading in t+1 Data
(CEPR ORG Extract, Version 1.7.0, 1996)
Sort vars
sort mym month state hhid hhnum lineno
Generate id
(note: file match19968.dta not found)
file match19968.dta saved
Reading in individual data
(CEPR ORG Extract, Version 1.7.0, 1995)
Generate mym for minsamp 4
Sort vars
sort mym month state hhid hhnum lineno
Generate id
Household/family-level match
Merging 1995 minsamp 4 households to minsamp 8 using match19968.dta 
(note: you are using old merge syntax; see [D] merge for new syntax)
variables mym month state hhid hhnum lineno do not uniquely identify observations in the
    master data
variables mym month state hhid hhnum lineno do not uniquely identify observations in
    match19968.dta
(223232 missing values generated)
(223232 missing values generated)
(35542 real changes made)
(224418 observations deleted)
158308 observations prior to match
35542 observations after match
(note: file ../basic_extract/org_merg1995.dta not found)
file ../basic_extract/org_merg1995.dta saved

. match2 1996 
Reading in t+1 Data
(CEPR ORG Extract, Version 1.7.0, 1997)
Sort vars
sort mym month state hhid hhnum lineno
Generate id
(note: file match19978.dta not found)
file match19978.dta saved
Reading in individual data
(CEPR ORG Extract, Version 1.7.0, 1996)
Generate mym for minsamp 4
Sort vars
sort mym month state hhid hhnum lineno
Generate id
Household/family-level match
Merging 1996 minsamp 4 households to minsamp 8 using match19978.dta 
(note: you are using old merge syntax; see [D] merge for new syntax)
variables mym month state hhid hhnum lineno do not uniquely identify observations in the
    master data
variables mym month state hhid hhnum lineno do not uniquely identify observations in
    match19978.dta
(58962 missing values generated)
(58962 missing values generated)
(107334 real changes made)
(61859 observations deleted)
139474 observations prior to match
107334 observations after match
(note: file ../basic_extract/org_merg1996.dta not found)
file ../basic_extract/org_merg1996.dta saved

. match2 1997 
Reading in t+1 Data
(CEPR ORG Extract, Version 1.7.0, 1998)
Sort vars
sort mym month state hhid hhnum lineno
Generate id
(note: file match19988.dta not found)
file match19988.dta saved
Reading in individual data
(CEPR ORG Extract, Version 1.7.0, 1997)
Generate mym for minsamp 4
Sort vars
sort mym month state hhid hhnum lineno
Generate id
Household/family-level match
Merging 1997 minsamp 4 households to minsamp 8 using match19988.dta 
(note: you are using old merge syntax; see [D] merge for new syntax)
(60029 missing values generated)
(60029 missing values generated)
(107058 real changes made)
(63002 observations deleted)
140702 observations prior to match
107058 observations after match
(note: file ../basic_extract/org_merg1997.dta not found)
file ../basic_extract/org_merg1997.dta saved

. match2 1998 
Reading in t+1 Data
(CEPR ORG Extract, Version 1.7.0, 1999)
Sort vars
sort mym month state hhid hhnum lineno
Generate id
(note: file match19998.dta not found)
file match19998.dta saved
Reading in individual data
(CEPR ORG Extract, Version 1.7.0, 1998)
Generate mym for minsamp 4
Sort vars
sort mym month state hhid hhnum lineno
Generate id
Household/family-level match
Merging 1998 minsamp 4 households to minsamp 8 using match19998.dta 
(note: you are using old merge syntax; see [D] merge for new syntax)
variables mym month state hhid hhnum lineno do not uniquely identify observations in the
    master data
variables mym month state hhid hhnum lineno do not uniquely identify observations in
    match19998.dta
(59147 missing values generated)
(59147 missing values generated)
(108059 real changes made)
(62339 observations deleted)
141003 observations prior to match
108059 observations after match
(note: file ../basic_extract/org_merg1998.dta not found)
file ../basic_extract/org_merg1998.dta saved

. match2 1999 
Reading in t+1 Data
(CEPR ORG Extract, Version 1.7.0, 2000)
Sort vars
sort mym month state hhid hhnum lineno
Generate id
(note: file match20008.dta not found)
file match20008.dta saved
Reading in individual data
(CEPR ORG Extract, Version 1.7.0, 1999)
Generate mym for minsamp 4
Sort vars
sort mym month state hhid hhnum lineno
Generate id
Household/family-level match
Merging 1999 minsamp 4 households to minsamp 8 using match20008.dta 
(note: you are using old merge syntax; see [D] merge for new syntax)
variables mym month state hhid hhnum lineno do not uniquely identify observations in the
    master data
variables mym month state hhid hhnum lineno do not uniquely identify observations in
    match20008.dta
(60771 missing values generated)
(60771 missing values generated)
(109223 real changes made)
(64152 observations deleted)
142070 observations prior to match
109223 observations after match
(note: file ../basic_extract/org_merg1999.dta not found)
file ../basic_extract/org_merg1999.dta saved

. match2 2000
Reading in t+1 Data
(CEPR ORG Extract, Version 1.7.0, 2001)
Sort vars
sort mym month state hhid hhnum lineno
Generate id
(note: file match20018.dta not found)
file match20018.dta saved
Reading in individual data
(CEPR ORG Extract, Version 1.7.0, 2000)
Generate mym for minsamp 4
Sort vars
sort mym month state hhid hhnum lineno
Generate id
Household/family-level match
Merging 2000 minsamp 4 households to minsamp 8 using match20018.dta 
(note: you are using old merge syntax; see [D] merge for new syntax)
variables mym month state hhid hhnum lineno do not uniquely identify observations in the
    master data
variables mym month state hhid hhnum lineno do not uniquely identify observations in
    match20018.dta
(71307 missing values generated)
(71307 missing values generated)
(107011 real changes made)
(74523 observations deleted)
139302 observations prior to match
107011 observations after match
(note: file ../basic_extract/org_merg2000.dta not found)
file ../basic_extract/org_merg2000.dta saved

. match2 2001
Reading in t+1 Data
(CEPR ORG Extract, Version 1.7.0, 2002)
Sort vars
sort mym month state hhid hhnum lineno
Generate id
(note: file match20028.dta not found)
file match20028.dta saved
Reading in individual data
(CEPR ORG Extract, Version 1.7.0, 2001)
Generate mym for minsamp 4
Sort vars
sort mym month state hhid hhnum lineno
Generate id
Household/family-level match
Merging 2001 minsamp 4 households to minsamp 8 using match20028.dta 
(note: you are using old merge syntax; see [D] merge for new syntax)
variables mym month state hhid hhnum lineno do not uniquely identify observations in the
    master data
variables mym month state hhid hhnum lineno do not uniquely identify observations in
    match20028.dta
(76493 missing values generated)
(76493 missing values generated)
(111198 real changes made)
(84543 observations deleted)
150546 observations prior to match
111198 observations after match
(note: file ../basic_extract/org_merg2001.dta not found)
file ../basic_extract/org_merg2001.dta saved

. match2 2002
Reading in t+1 Data
(CEPR ORG Extract, Version 1.7.0, 2003)
Sort vars
sort mym month state hhid hhnum lineno
Generate id
(note: file match20038.dta not found)
file match20038.dta saved
Reading in individual data
(CEPR ORG Extract, Version 1.7.0, 2002)
Generate mym for minsamp 4
Sort vars
sort mym month state hhid hhnum lineno
Generate id
Household/family-level match
Merging 2002 minsamp 4 households to minsamp 8 using match20038.dta 
(note: you are using old merge syntax; see [D] merge for new syntax)
variables mym month state hhid hhnum lineno do not uniquely identify observations in the
    master data
variables mym month state hhid hhnum lineno do not uniquely identify observations in
    match20038.dta
(67549 missing values generated)
(67549 missing values generated)
(120494 real changes made)
(78551 observations deleted)
165552 observations prior to match
120494 observations after match
(note: file ../basic_extract/org_merg2002.dta not found)
file ../basic_extract/org_merg2002.dta saved

. match2 2003
Reading in t+1 Data
(CEPR ORG Extract, Version 1.7.0, 2004)
Sort vars
sort mym month state hhid hhnum lineno
Generate id
(note: file match20048.dta not found)
file match20048.dta saved
Reading in individual data
(CEPR ORG Extract, Version 1.7.0, 2003)
Generate mym for minsamp 4
Sort vars
sort mym month state hhid hhnum lineno
Generate id
Household/family-level match
Merging 2003 minsamp 4 households to minsamp 8 using match20048.dta 
(note: you are using old merge syntax; see [D] merge for new syntax)
variables mym month state hhid hhnum lineno do not uniquely identify observations in the
    master data
variables mym month state hhid hhnum lineno do not uniquely identify observations in
    match20048.dta
(72597 missing values generated)
(72597 missing values generated)
(120039 real changes made)
(79999 observations deleted)
163589 observations prior to match
120039 observations after match
(note: file ../basic_extract/org_merg2003.dta not found)
file ../basic_extract/org_merg2003.dta saved

. match2 2004
Reading in t+1 Data
(CEPR ORG Extract, Version 1.7.0, 2005)
Sort vars
sort mym month state hhid hhnum lineno
Generate id
(note: file match20058.dta not found)
file match20058.dta saved
Reading in individual data
(CEPR ORG Extract, Version 1.7.0, 2004)
Generate mym for minsamp 4
Sort vars
sort mym month state hhid hhnum lineno
Generate id
Household/family-level match
Merging 2004 minsamp 4 households to minsamp 8 using match20058.dta 
(note: you are using old merge syntax; see [D] merge for new syntax)
variables mym month state hhid hhnum lineno do not uniquely identify observations in the
    master data
variables mym month state hhid hhnum lineno do not uniquely identify observations in
    match20058.dta
(89824 missing values generated)
(89824 missing values generated)
(108639 real changes made)
(96903 observations deleted)
158952 observations prior to match
108639 observations after match
(note: file ../basic_extract/org_merg2004.dta not found)
file ../basic_extract/org_merg2004.dta saved

. match2 2005
Reading in t+1 Data
(CEPR ORG Extract, Version 1.7.0, 2006)
Sort vars
sort mym month state hhid hhnum lineno
Generate id
(note: file match20068.dta not found)
file match20068.dta saved
Reading in individual data
(CEPR ORG Extract, Version 1.7.0, 2005)
Generate mym for minsamp 4
Sort vars
sort mym month state hhid hhnum lineno
Generate id
Household/family-level match
Merging 2005 minsamp 4 households to minsamp 8 using match20068.dta 
(note: you are using old merge syntax; see [D] merge for new syntax)
variables mym month state hhid hhnum lineno do not uniquely identify observations in the
    master data
variables mym month state hhid hhnum lineno do not uniquely identify observations in
    match20068.dta
(70737 missing values generated)
(70737 missing values generated)
(118468 real changes made)
(77582 observations deleted)
160587 observations prior to match
118468 observations after match
(note: file ../basic_extract/org_merg2005.dta not found)
file ../basic_extract/org_merg2005.dta saved

. match2 2006
Reading in t+1 Data
(CEPR ORG Extract, Version 1.7.0, 2007)
Sort vars
hhid2 already string; no replace
sort mym month state hhid hhnum lineno hhid2
Generate id
(note: file match20078.dta not found)
file match20078.dta saved
Reading in individual data
(CEPR ORG Extract, Version 1.7.0, 2006)
Generate mym for minsamp 4
Sort vars
hhid2 was float now str5
sort mym month state hhid hhnum lineno hhid2
Generate id
Household/family-level match
Merging 2006 minsamp 4 households to minsamp 8 using match20078.dta 
(note: you are using old merge syntax; see [D] merge for new syntax)
(69201 missing values generated)
(69201 missing values generated)
(117315 real changes made)
(76616 observations deleted)
159671 observations prior to match
117315 observations after match
(note: file ../basic_extract/org_merg2006.dta not found)
file ../basic_extract/org_merg2006.dta saved

. match2 2007
Reading in t+1 Data
(CEPR ORG Extract, Version 1.7.0, 2008)
Sort vars
hhid2 already string; no replace
sort mym month state hhid hhnum lineno hhid2
Generate id
(note: file match20088.dta not found)
file match20088.dta saved
Reading in individual data
(CEPR ORG Extract, Version 1.7.0, 2007)
Generate mym for minsamp 4
Sort vars
hhid2 already string; no replace
sort mym month state hhid hhnum lineno hhid2
Generate id
Household/family-level match
Merging 2007 minsamp 4 households to minsamp 8 using match20088.dta 
(note: you are using old merge syntax; see [D] merge for new syntax)
(65615 missing values generated)
(65615 missing values generated)
(119703 real changes made)
(72458 observations deleted)
159217 observations prior to match
119703 observations after match
(note: file ../basic_extract/org_merg2007.dta not found)
file ../basic_extract/org_merg2007.dta saved

. match2 2008
Reading in t+1 Data
(CEPR ORG Extract, Version 1.7.0, 2009)
Sort vars
hhid2 already string; no replace
sort mym month state hhid hhnum lineno hhid2
Generate id
(note: file match20098.dta not found)
file match20098.dta saved
Reading in individual data
(CEPR ORG Extract, Version 1.7.0, 2008)
Generate mym for minsamp 4
Sort vars
hhid2 already string; no replace
sort mym month state hhid hhnum lineno hhid2
Generate id
Household/family-level match
Merging 2008 minsamp 4 households to minsamp 8 using match20098.dta 
(note: you are using old merge syntax; see [D] merge for new syntax)
(65227 missing values generated)
(65227 missing values generated)
(119751 real changes made)
(71664 observations deleted)
157851 observations prior to match
119751 observations after match
(note: file ../basic_extract/org_merg2008.dta not found)
file ../basic_extract/org_merg2008.dta saved

. match2 2009
Reading in t+1 Data
(CEPR ORG Extract, Version 1.7.0, 2010)
Sort vars
hhid2 already string; no replace
sort mym month state hhid hhnum lineno hhid2
Generate id
(note: file match20108.dta not found)
file match20108.dta saved
Reading in individual data
(CEPR ORG Extract, Version 1.7.0, 2009)
Generate mym for minsamp 4
Sort vars
hhid2 already string; no replace
sort mym month state hhid hhnum lineno hhid2
Generate id
Household/family-level match
Merging 2009 minsamp 4 households to minsamp 8 using match20108.dta 
(note: you are using old merge syntax; see [D] merge for new syntax)
(64613 missing values generated)
(64613 missing values generated)
(122126 real changes made)
(71460 observations deleted)
161189 observations prior to match
122126 observations after match
(note: file ../basic_extract/org_merg2009.dta not found)
file ../basic_extract/org_merg2009.dta saved

. match2 2010
Reading in t+1 Data
(CEPR ORG Extract, Version 1.7.0, 2011)
Sort vars
hhid2 already string; no replace
sort mym month state hhid hhnum lineno hhid2
Generate id
(note: file match20118.dta not found)
file match20118.dta saved
Reading in individual data
(CEPR ORG Extract, Version 1.7.0, 2010)
Generate mym for minsamp 4
Sort vars
hhid2 already string; no replace
sort mym month state hhid hhnum lineno hhid2
Generate id
Household/family-level match
Merging 2010 minsamp 4 households to minsamp 8 using match20118.dta 
(note: you are using old merge syntax; see [D] merge for new syntax)
(64754 missing values generated)
(64754 missing values generated)
(120800 real changes made)
(71154 observations deleted)
159907 observations prior to match
120800 observations after match
(note: file ../basic_extract/org_merg2010.dta not found)
file ../basic_extract/org_merg2010.dta saved

. 
. log close
      name:  <unnamed>
       log:  /data/uctprgu/cps/program/log_matchorg.log
  log type:  text
 closed on:   2 May 2012, 16:55:56
------------------------------------------------------------------------------------------
