---------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /data/uctprgu/cps/program/log_combine.log
  log type:  text
 opened on:   3 May 2012, 01:52:36

. set more 1

. 
. local sort year qtr month date t

. 
. *merge unemployment, vacancy, productivity, E2U, U2E, J2J, wage percentiles, copula p
> arameters, and flows between wage deciles
. 
. use ../BLS/unemployment_raw_m.dta

. 
. merge 1:1 `sort' using ../BLS/prod_raw_q.dta
month was byte now float

    Result                           # of obs.
    -----------------------------------------
    not matched                           514
        from master                       514  (_merge==1)
        from using                          0  (_merge==2)

    matched                               256  (_merge==3)
    -----------------------------------------

. drop _merge

. sort `sort'

. 
. merge 1:1 `sort' using ../BLS/jolts_raw_m.dta

    Result                           # of obs.
    -----------------------------------------
    not matched                           636
        from master                       636  (_merge==1)
        from using                          0  (_merge==2)

    matched                               134  (_merge==3)
    -----------------------------------------

. drop _merge

. sort `sort'

. 
. merge 1:1 `sort' using ../BLS/help_raw_m.dta

    Result                           # of obs.
    -----------------------------------------
    not matched                           103
        from master                       103  (_merge==1)
        from using                          0  (_merge==2)

    matched                               667  (_merge==3)
    -----------------------------------------

. drop _merge

. sort `sort'

. 
. merge 1:1 `sort' using ../BLS/help_online_raw_m.dta

    Result                           # of obs.
    -----------------------------------------
    not matched                           689
        from master                       688  (_merge==1)
        from using                          1  (_merge==2)

    matched                                82  (_merge==3)
    -----------------------------------------

. drop _merge

. sort `sort'

. 
. merge 1:1 `sort' using ../result/sa_basic.dta
date was float now double

    Result                           # of obs.
    -----------------------------------------
    not matched                           240
        from master                       240  (_merge==1)
        from using                          0  (_merge==2)

    matched                               531  (_merge==3)
    -----------------------------------------

. drop _merge

. sort `sort'

. label var SA_EU "E2U flows seasonally adjusted"

. label var SA_UE "U2E flows seasonally adjusted"

. 
. merge 1:1 `sort' using ../result/sa_j2j.dta

    Result                           # of obs.
    -----------------------------------------
    not matched                           559
        from master                       559  (_merge==1)
        from using                          0  (_merge==2)

    matched                               212  (_merge==3)
    -----------------------------------------

. drop _merge

. sort `sort'

. label var SA_J2J "J2J flows seasonally adjusted"

. 
. 
. merge 1:1 `sort' using ../result/sa_copula.dta
year was int now float

    Result                           # of obs.
    -----------------------------------------
    not matched                           387
        from master                       387  (_merge==1)
        from using                          0  (_merge==2)

    matched                               384  (_merge==3)
    -----------------------------------------

. drop _merge

. sort `sort'

. label var SA_corr "correlation of t-copula of this month and the same month last year
>  seasonally adjusted"
note: label truncated to 80 characters

. label var SA_df "degree of freedom of t-copula of this month and the same month last 
> year seasonally adjusted"
note: label truncated to 80 characters

. 
. 
. merge 1:1 `sort' using ../result/sa_pctile.dta

    Result                           # of obs.
    -----------------------------------------
    not matched                           375
        from master                       375  (_merge==1)
        from using                          0  (_merge==2)

    matched                               396  (_merge==3)
    -----------------------------------------

. drop _merge

. sort `sort'

. forvalues i = 1(1)99 {
  2.   label var SA_p`i' "`i' pctile of hourly wage seasonally adjusted"
  3. }

. 
. merge 1:1 `sort' using ../result/sa_transition.dta

    Result                           # of obs.
    -----------------------------------------
    not matched                           387
        from master                       387  (_merge==1)
        from using                          0  (_merge==2)

    matched                               384  (_merge==3)
    -----------------------------------------

. drop _merge

. sort `sort'

. forvalues m = 1/10 { 
  2.   forvalues n = 1/10 {
  3.     label var SA_tranD`m'D`n' "flow to decile`n' of this month from decile`m' of t
> he same month last year (SA)"
  4.   }
  5. }

. 
. saveold ../result/final.dta, replace
file ../result/final.dta saved

. 
. 
. 
. *merge the following series by education levels: unemployment, E2U, U2E, J2J
. clear

. use ../result/edu_ur.dta

. forvalues i = 1/6 {
  2.   label var ur`i'  "unemployment rate of education level `i'"
  3.   label var epr`i'  "employment population ratio of education level `i'"
  4. }

. 
. merge 1:1 `sort' using ../result/edu_basic.dta

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                               428  (_merge==3)
    -----------------------------------------

. drop _merge

. sort `sort'

. forvalues i = 1/6 {
  2.   label var flowsEU`i' "E2U flows of education level `i'"
  3.   label var flowsUE`i' "U2E flows of education level `i'"
  4. }

. 
. merge 1:1 `sort' using ../result/edu_j2j.dta

    Result                           # of obs.
    -----------------------------------------
    not matched                           216
        from master                       216  (_merge==1)
        from using                          0  (_merge==2)

    matched                               212  (_merge==3)
    -----------------------------------------

. drop _merge

. sort `sort'

. forvalues i = 1/6 {
  2.   label var flowsJ2J`i' "J2J flows of education level `i'"
  3. }

. 
. 
. saveold ../result/edu.dta, replace
(note: file ../result/edu.dta not found)
file ../result/edu.dta saved

. 
. 
. log close
      name:  <unnamed>
       log:  /data/uctprgu/cps/program/log_combine.log
  log type:  text
 closed on:   3 May 2012, 01:52:37
---------------------------------------------------------------------------------------
